---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarConstraint
source: html/3a2afe27-b578-5d23-611e-ceb2be08c0b4.htm
---
# RebarConstraint Members

Returns true if the gemetrical targets (ex. face references, other rebar segment references) of "this" constriant are the same as the targets of the "other" constraint.
 Returns false otherwise.
 Only the reference to the target piece of geometry is taken into account(ex. only face references, only other rebar segment references).
 Target Element (elementId) is not taken into account.
 Distance to target is not taken into account.